{"format": "layers-model", "generatedBy": "keras v2.1.5", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.1.5", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "batch_input_shape": [null, 256, 256, 1], "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "mse", "metrics": ["mae_months"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of33.bin", "group1-shard2of33.bin", "group1-shard3of33.bin", "group1-shard4of33.bin", "group1-shard5of33.bin", "group1-shard6of33.bin", "group1-shard7of33.bin", "group1-shard8of33.bin", "group1-shard9of33.bin", "group1-shard10of33.bin", "group1-shard11of33.bin", "group1-shard12of33.bin", "group1-shard13of33.bin", "group1-shard14of33.bin", "group1-shard15of33.bin", "group1-shard16of33.bin", "group1-shard17of33.bin", "group1-shard18of33.bin", "group1-shard19of33.bin", "group1-shard20of33.bin", "group1-shard21of33.bin", "group1-shard22of33.bin", "group1-shard23of33.bin", "group1-shard24of33.bin", "group1-shard25of33.bin", "group1-shard26of33.bin", "group1-shard27of33.bin", "group1-shard28of33.bin", "group1-shard29of33.bin", "group1-shard30of33.bin", "group1-shard31of33.bin", "group1-shard32of33.bin", "group1-shard33of33.bin"], "weights": [{"name": "batch_normalization_3/gamma", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [1], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [65536, 512], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [1], "dtype": "float32"}]}]}